# 1.有一个列表，[“北京”,”上海”,”广东”]
# 1)将中国所有省会城市添加到上述列表中
# 2)广东成为第二大发达城市，将广东排在上海前面
# 3)[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]这是中国GDP排名前8的城市的GDP数值，请统计前8城市的GDP总和，平均GDP。
#####****************************
list=["北京","上海","广东","天津","重庆","黑龙江","吉林","辽宁","内蒙古","河北","新疆维吾尔","甘肃","青海",
      "陕西","宁夏","河南","山东","山西","安徽","湖南","湖北","江苏","四川","贵州","云南","广西","西藏","浙江","江西","福建","台湾","海南","香港","澳门"]
for i  in range(len(list)):
    print(list[i],end=" ")
print()
#***********************************
g=0
s=0
for a,b in enumerate(list):
    if b=="上海":
       g=a
    if b=="广东":
       s = a
print()
list.append(list[s])
list.append(list[g])
for i  in range(len(list)):
    if i==s:
       continue
    elif i==g:
         continue
    print(list[i], end=" ")
print()
print()
#********************************
n=0
list=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
for i  in range(len(list)):
    n=n+list[i]
print("前8城市的GDP总和",n)
print("前8城市的平均GDP",n/8)