from unittest import TestCase
from ddt import ddt
from ddt import data
from ddt import unpack
#4.转账
from Bank import bank_transformMoney
da_zz = [
["00000000","11111111","123456",-1,3],#-1
["00000000","11111111","123456",0,0],#0
["00000000","11111111","123456",1,0],#1
["22222222","11111111","123456",599,0],#599
["33333333","11111111","123456",600,0],#600
["44444444","11111111","123456",601,3],#601
["00000001","11111111","123456",1,1],#转出账号不对
["00000000","11111111","12345",1,2],#转出密码不对
["00000000","11111110","123456",1,1],#转入账号不对
["00000001","11111110","123456",1,1],#转出账号，转入账号不对
["00000001","11111111","12345",1,1],#转出账号，转出密码不对
["00000000","11111111","12345",1,1],#转入账号，转出密码不对
["00000001","11111110","12345",1,1],#转出账号，转入账号转出密码不对
["00000000","","123456",1,1],#转入账号空
["","11111111","123456",1,1],#转出账号空
["00000000","11111111","",1,2],#转出密码空
["","11111111","",1,1],#转出账号，转出密码空
["00000000","","",1,1],#转出账号，转出密码空
["","","123456",1,1],#转出账号，转入账号空
["","","",1,1]#转出账号，转出密码，转入账号空
]
@ddt
class zz(TestCase):
    @data(*da_zz)
    @unpack
    def testtransformMoney(self,a,b,c,d,e):
        result = bank_transformMoney(a,b,c,d)
        self.assertEqual(result,e)