'''
2.现在魔法学院有赫敏、哈利、罗恩、马尔福四个人的几次魔法作业的成绩。
但是呢，因为有些魔法作业有一定难度，教授不强制同学们必须上交，所以大家上交作业的次数并不一致。
[罗恩, 23 ,35 ,44]
[哈利 ,60, 77 ,68 ,88, 90]
[赫敏, 97 ,99 ,89 ,91, 95, 90]
[马尔福 ,100, 85 ,90]
求每个人的总成绩？
'''
ln=["罗恩", 23 ,35 ,44]
n=0
for i in range(1,len(ln)):
    n=n+ln[i]
print(ln[0],"总成绩:",n)

hl=["哈利" ,60, 77 ,68 ,88, 90]
n=0
for i in range(1,len(hl)):
    n=n+hl[i]
print(hl[0],"总成绩:",n)

hm=["赫敏", 97 ,99 ,89 ,91, 95, 90]
n=0
for i in range(1,len(hm)):
    n=n+hm[i]
print(hm[0],"总成绩:",n)

mrf=["马尔福 ",100, 85 ,90]
n=0
for i in range(1,len(mrf)):
    n=n+mrf[i]
print(mrf[0],"总成绩:",n)
